---
kind: method
id: M:Autodesk.Revit.DB.ElementId.#ctor(Autodesk.Revit.DB.BuiltInParameter)
source: html/cde49e84-86c6-1fc8-2c50-e5fc6b627470.htm
---
# Autodesk.Revit.DB.ElementId.#ctor Method

Create an ElementId handle with the given BuiltInParameter id.

## Syntax (C#)
```csharp
public ElementId(
	BuiltInParameter parameterId
)
```

## Parameters
- **parameterId** (`Autodesk.Revit.DB.BuiltInParameter`) - The id.